In [1]:
import selenium
from selenium import webdriver
from selenium.webdriver.common.by import By
import warnings
warnings.filterwarnings('ignore')
import time
import pandas as pd

# Q1: Write a python program to scrape data for “Data Analyst” Job position in “Bangalore” location. You have to scrape the job-title, job-location, company_name, experience_required. You have to scrape first 10 jobs data.

In [2]:
driver=webdriver.Chrome()

In [3]:
driver.get('https://www.shine.com/')

In [ ]:
clk=driver.find_element(By.XPATH,'//*[@id="mobileSearchBar"]/span/span[1]')
clk.click()

In [ ]:
post=driver.find_element(By.CLASS_NAME,'form-control  ')
post.send_keys('Data Analyst')

loc=driver.find_element(By.XPATH,'//*[@id="id_loc"]')
loc.send_keys('Bangalore')

search=driver.find_element(By.XPATH,'//*[@id="__next"]/div[4]/div/div[2]/div[2]/div/form/div/div[2]/div/button')
search.click()

In [17]:
type(search)

selenium.webdriver.remote.webelement.WebElement

In [18]:
jobs=[]
job=driver.find_elements(By.CLASS_NAME,'false')
for i in job:
    jobs.append(i.text)

# print(jobs)

In [20]:
df=pd.DataFrame(data=jobs,columns=['JOBS_With_Details'])
print(df.head(10))

                                   JOBS_With_Details
0  6 days ago\nData Analyst Vacancy\ndivya interp...
1
2  6 days ago\nData Analyst Vacancy\ndivya interp...
3
4
5
6
7
8
9

Q2:Write a python program to scrape data for “Data Scientist” Job position in“Bangalore” location. You have to scrape the job-title, job-location, company_name. You have to scrape first 10 jobs data. This task will be done in following steps:

This task will be done in following steps:
1. First get the webpage https://www.shine.com/
2. Enter “Data Scientist” in “Job title, Skills” field and enter “Bangalore” in “enter thelocation” field.
3. Then click the search button.
4. Then scrape the data for the first 10 jobs results you get.
5. Finally create a dataframe of the scraped data.

In [2]:
driver=webdriver.Chrome()
driver.get('https://www.shine.com/')

In [3]:
post=driver.find_element(By.CLASS_NAME,'form-control  ')
post.send_keys('Data Scientist')

loc=driver.find_element(By.XPATH,'//*[@id="id_loc"]')
loc.send_keys('Bangalore')

search=driver.find_element(By.XPATH,'//*[@id="__next"]/div[4]/div/div[2]/div[2]/div/form/div/div[2]/div/button')
search.click()

In [4]:
job_title=[]
job_location=[]
company_name=[]

In [10]:
title=driver.find_elements(By.CLASS_NAME,'title ')
for i in title:
    job_title.append(i.text)

In [6]:
loc=driver.find_elements(By.CLASS_NAME,'jobCard_locationIcon__zrWt2')
for i in loc:
    job_location.append(i.text)

In [30]:
company=driver.find_elements(By.CLASS_NAME,'jobCard_jobCard_cName__mYnow')
for i in company:
    company_name.append(i.text)

In [31]:
company_name
# company_name.clear()

['divya interprises',
 'divya interprises',
 'the fashion cosmo',
 'bosch group',
 'shiva hr services',
 'bosch group',
 'bosch group',
 'divya interprises',
 'racanaa energy solution private lim...',
 'true caller',
 'capgemini technology services india...',
 'jpmorgan',
 'siemens limited',
 'mnr solutions pvt ltd',
 'bosch group',
 'mnr solutions pvt ltd',
 'mercede',
 'the fashion cosmo',
 'bosch group',
 'infosys limited']

In [97]:
# len(company_name)

In [25]:
print(len(job_title),len(job_location),len(company_name))

20 20 20

In [32]:
import pandas as pd
df=pd.DataFrame({'JOB_TITLE':job_title,'JOB_LOCATION':job_location,'COMPANY_NAME':company_name})
df

,JOB_TITLE,JOB_LOCATION,COMPANY_NAME
0,Data Scientist Vacancy,Bangalore\n+14,divya interprises
1,Data Scientist Urgent Recruitment,Bangalore\n+14,divya interprises
2,Data Scientist- Bangalore,Bangalore,the fashion cosmo
3,Data Scientist AI ML CV,Bangalore,bosch group
4,Data Scientist-Bangalore,Bangalore,shiva hr services
5,Data Scientist AI ML NLP,Bangalore,bosch group
6,Phd Data Scientist,Bangalore,bosch group
7,Hiring For Data Scientist,Bangalore\n+14,divya interprises
8,Data Scientist,Bangalore,racanaa energy solution private lim...
9,Staff Data Scientist & Team Lead,Bangalore,true caller
10,Data scientist,Bangalore\n+8,capgemini technology services india...
11,Data Scientist Associate Sr - NLP,Bangalore,jpmorgan
12,Data Scientist,Bangalore,siemens limited
13,Data Scientist,Bangalore\n+1,mnr solutions pvt ltd
14,Data Scientist,Bangalore,bosch group
15,Data Scientist,Bangalore\n+6,mnr solutions pvt ltd
16,Data scientist Drivetrain,Bangalore,mercede
17,Data Scientist- Bangalore,Bangalore,the fashion cosmo
18,Data Architect,Bangalore,bosch group
19,Data Scientist,Bangalore,infosys limited

In [17]:
na=[]
j=driver.find_elements(By.XPATH,'/html/body/div[1]/div[1]/div[4]/div/div[1]/div[1]/div/div/div[1]/div[1]/div[1]/h2/a')
for i in j:
    na.append(i.text)

Q3: In this question you have to scrape data using the filters available on the webpage You have to use the location and salary filter. You have to scrape data for “Data Scientist” designation for first 10 job results. You have to scrape the job-title, job-location, company name, experience required. The location filter to be used is “Delhi/NCR”. The salary filter to be used is “3-6” lakhs
The task will be done as shown in the below steps:
1. first get the web page https://www.shine.com/
2. Enter “Data Scientist” in “Skill, Designations, and Companies” field.
3. Then click the search button.
4. Then apply the location filter and salary filter by checking the respective boxes
5. Then scrape the data for the first 10 jobs results you get.
6. Finally create a dataframe of the scrapeddata.

In [43]:
driver=webdriver.Chrome()
driver.get('https://www.shine.com/')

In [45]:
post=driver.find_element(By.CLASS_NAME,'form-control  ')
post.send_keys('Data Scientist')

loc=driver.find_element(By.XPATH,'//*[@id="id_loc"]')
loc.send_keys('Delhi-ncr Region')

search=driver.find_element(By.XPATH,'//*[@id="__next"]/div[4]/div/div[2]/div[2]/div/form/div/div[2]/div/button')
search.click()

In [83]:
job_title=[]
job_location=[]
company_name=[]
experience_required=[]

In [130]:
title=driver.find_elements(By.CLASS_NAME,'jobCard_jobCard_cName__mYnow')
for i in title:
    job_title.append(i.text)

In [132]:
# job_title

In [133]:
# job_title.clear()

In [145]:
loc=driver.find_elements(By.CLASS_NAME,'jobCard_locationIcon__zrWt2')
for i in loc:
    job_location.append(i.text)

In [146]:
# job_location
# job_location.clear()

In [139]:
company=driver.find_elements(By.CLASS_NAME,'jobCard_jobCard_cName__mYnow')
for i in company:
    company_name.append(i.text)

In [137]:
# company_name.clear()

In [109]:
# company_name

In [150]:
experience=driver.find_elements(By.CLASS_NAME,'jobCard_jobIcon__3FB1t')
for i in experience:
    experience_required.append(i.text)

In [153]:
# experience_required
# experience_required.clear()

In [151]:
print(len(job_title),len(job_location),len(company_name),len(experience_required))

20 20 20 20

In [159]:
import pandas as pd
df=pd.DataFrame({'JOB_TITLE':job_title,'COMPANY_NAME':company_name,'JOB_LOCATION':job_location,'EXPERIENCE_REQUIRED':experience_required})
df

,JOB_TITLE,COMPANY_NAME,JOB_LOCATION,EXPERIENCE_REQUIRED
0,Data Scientist- Delhi,the fashion cosmo,Delhi,0 to 3 Yrs
1,Data Scientist-Delhi,shiva hr services,Delhi,0 to 3 Yrs
2,Data Scientist- Delhi,the fashion cosmo,Delhi,0 to 3 Yrs
3,Data Scientist- Delhi,the fashion cosmo,Delhi,0 to 3 Yrs
4,Data Scientist,acme services private limited,Delhi\n+4,3 to 5 Yrs
5,Data Scientist,quiscon biotech,Delhi\n+6,0 to 1 Yr
6,Data Scientist,acme services private limited,Delhi\n+4,3 to 5 Yrs
7,Data Scientist,techno endura,Delhi\n+6,0 to 1 Yr
8,Data Scientist,v-tech data outsourcing,Delhi\n+9,0 to 2 Yrs
9,Clinical Data Analyst,national seeds corporation limited,Delhi\n+17,1 to 6 Yrs
10,Data Modeler,techno endura,Delhi\n+6,0 to 1 Yr
11,Biostatistician,seven consultancy,Delhi,1 to 3 Yrs
12,Biostatistician,bajaj finserv lending ltd,Delhi,3 to 6 Yrs
13,Clinical Data Management,srinsoft technologies,Delhi,3 to 5 Yrs
14,Py spark Architect Delhi,techno endura,Delhi\n+6,0 to 1 Yr
15,Senior AI Data Scientist-Reputed IT Industry,mnr solutions pvt ltd,Delhi\n+6,1 to 5 Yrs
16,Req. post for Junior AI Data Scientist-Reputed...,ntt global delivery services limite...,Delhi,0 to 4 Yrs
17,Business Development Executive,techno endura,Delhi\n+6,0 to 1 Yr
18,Senior Manager - DMS Support/Senior Manager - ...,krishna consultancy.. hiring for co...,Delhi\n+9,4 to 9 Yrs
19,Remote _Data Entry Specialists,techno endura,Delhi\n+6,0 to 1 Yr

Q4: Scrape data of first 100 sunglasses listings on flipkart.com. You have to scrape four attributes:
  * 6. Brand
  * 7. ProductDescription
  * 8. Price
  
The attributes which you have to scrape is ticked marked in the below image.

To scrape the data you have to go through following steps:
1. Go to Flipkart webpage by url :https://www.flipkart.com/
2. Enter “sunglasses” in the search fieldwhere “search for products, brands and more” is written and
click the search icon
3. After that you will reach to the page having a lot of sunglasses. From this page you can scrap the
required data as usual.

In [164]:
driver=webdriver.Chrome()
driver.get('https://www.flipkart.com/')

In [165]:
glass=driver.find_element(By.CLASS_NAME,'Pke_EE')
glass.send_keys('sunglasses')

search=driver.find_element(By.CLASS_NAME,'_2iLD__')
search.click()

In [179]:
brand=[]
description=[]
price=[]

In [206]:
start=0
end=3
for page in range(start,end):
    title=driver.find_elements(By.CLASS_NAME,'_2WkVRV')
    for i in title:
        brand.append(i.text)

In [174]:
# brand.clear()

In [207]:
print(len(brand))

120

In [180]:
start=0
end=3
for page in range(start,end):
    des=driver.find_elements(By.CLASS_NAME,'IRpwTa')
    for i in des:
        description.append(i.text)

In [208]:
print(len(description))

120

In [212]:
start=0
end=3
for page in range(start,end):
    cost=driver.find_elements(By.CLASS_NAME,'_30jeq3')
    for i in cost:
        price.append(i.text)

In [233]:
len(price)

120

In [230]:
print(len(brand),len(description),len(price))

120 120 120

In [232]:
import pandas as pd
df=pd.DataFrame({'NAME OF SUNGLASS':brand,'PRICE OF SUNGLASS':price,'DESCRIPTION OF SUNGLASS':description})
df.head(100)

,NAME OF SUNGLASS,PRICE OF SUNGLASS,DESCRIPTION OF SUNGLASS
0,VINCENT CHASE,₹499,UV Protection Clubmaster Sunglasses (53)
1,Fastrack,₹449,UV Protection Rectangular Sunglasses (Free Size)
2,SRPM,₹149,UV Protection Wayfarer Sunglasses (50)
3,Fastrack,₹549,UV Protection Wayfarer Sunglasses (58)
4,GANSTA,₹79,"Night Vision, Riding Glasses Rectangular Sungl..."
...,...,...,...
95,Roadster,₹199,UV Protection Rectangular Sunglasses (59)
96,VINCENT CHASE,₹149,UV Protection Wayfarer Sunglasses (59)
97,VINCENT CHASE,₹599,"Polarized, UV Protection Round Sunglasses (51)"
98,ROZZETTA CRAFT,₹254,"UV Protection, Gradient Rectangular Sunglasses..."
99,PIRASO,₹199,UV Protection Clubmaster Sunglasses (54)

Q5: Scrape 100 reviews data from flipkart.com for iphone11 phone. You have to go the link:
https://www.flipkart.com/apple-iphone-11-black-64-gb/p/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZE3ENS&marketplace=FLIPKART&q=iphone+11&store=tyy/4io&srno=s_1_1&otracker=AS_Query_HistoryAutoSuggest_6_0_na_na_na&otracker1=AS_Query_HistoryAutoSuggest_6_0_na_na_na&fm=organic&iid=e30aaa70-fe6e-466c-81d4-993e630ea913.MOBFWQ6BXGJCEYNY.SEARCH&ppt=hp&ppn=homepage&ssid=nseg9l47e80000001699187524593&qH=f6cdfdaa9f3c23f3

place=FLIPKART 

As shown in the above page you have to scrape the tick marked attributes. These are:
1. Rating
2. Review summary
3. Full review
4. You have to scrape this data for first 100reviews.

In [234]:
driver=webdriver.Chrome()
driver.get('https://www.flipkart.com/apple-iphone-11-black-64-gb/p/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZE3ENS&marketplace=FLIPKART&q=iphone+11&store=tyy/4io&srno=s_1_1&otracker=AS_Query_HistoryAutoSuggest_6_0_na_na_na&otracker1=AS_Query_HistoryAutoSuggest_6_0_na_na_na&fm=organic&iid=e30aaa70-fe6e-466c-81d4-993e630ea913.MOBFWQ6BXGJCEYNY.SEARCH&ppt=hp&ppn=homepage&ssid=nseg9l47e80000001699187524593&qH=f6cdfdaa9f3c23f3')

In [235]:
rating=[]
review=[]
full_review=[]

In [246]:
start=0
end=7
for page in range(start,end):
    rat=driver.find_elements(By.CLASS_NAME,'_1wB99o')
    for i in rat:
        rating.append(i.text)

In [252]:
start=0
end=10
for page in range(start,end):
    view=driver.find_elements(By.CLASS_NAME,'_2-N8zT')
    for i in view:
        review.append(i.text)

In [253]:
len(review)

100

In [254]:
start=0
end=10
for page in range(start,end):
    full=driver.find_elements(By.CLASS_NAME,'t-ZTKy')
    for i in full:
        full_review.append(i.text)

In [255]:
len(full_review)

100

In [262]:
print(len(rating),len(review),len(full_review))

100 100 100

In [264]:
import pandas as pd
df=pd.DataFrame({'RATING':rating,'REVIEW':review,'FULL_REVIEW':full_review})
df

,RATING,REVIEW,FULL_REVIEW
0,,Highly recommended,Awesome Battery Life...Camera clarity is too g...
1,,Perfect product!,Photos super
2,,Terrific purchase,Value for money 😍
3,,Best in the market!,Good Camera
4,,Worth every penny,Feeling awesome after getting the delivery of ...
...,...,...,...
95,,Classy product,Camera is awesome\nBest battery backup\nA perf...
96,,Terrific,Very very good
97,,Wonderful,This is amazing at all
98,,Must buy!,"Go for iPhone 11 , if confused between iPhone ..."
99,,Fabulous!,Super🔥 and good performance 👌❤️

Q6: Scrape data forfirst 100 sneakers you find whenyou visit flipkart.com and search for “sneakers” inthe
search field.
You have to scrape 3 attributes of each sneaker:
1. Brand
2. ProductDescription
3. Price

As shown in the below image, you have to scrape the above attributes.

In [266]:
driver=webdriver.Chrome()
driver.get('https://www.flipkart.com/')

In [267]:
find=driver.find_element(By.CLASS_NAME,'Pke_EE')
find.send_keys('sneakers')

search=driver.find_element(By.CLASS_NAME,'_2iLD__')
search.click()

In [268]:
brand=[]
description=[]
price=[]

In [269]:
start=0
end=3
for page in range(start,end):
    title=driver.find_elements(By.CLASS_NAME,'_2WkVRV')
    for i in title:
        brand.append(i.text)

In [270]:
len(brand)

120

In [271]:
start=0
end=3
for page in range(start,end):
    des=driver.find_elements(By.CLASS_NAME,'IRpwTa')
    for i in des:
        description.append(i.text)

In [272]:
len(description)

120

In [288]:
start=0
end=3
for page in range(start,end):
    cost=driver.find_elements(By.CLASS_NAME,'_30jeq3')
    for i in cost:
        price.append(i.text)

In [307]:
len(price)

120

In [286]:
price.clear()

In [305]:
print(len(brand),len(description),len(price))

120 120 120

In [308]:
import pandas as pd
df=pd.DataFrame({'SNEAKERS':brand,'DESCRIPTION':description,'PRICE':price})
df.head(100)

           SNEAKERS                                        DESCRIPTION   PRICE
0            BRUTON  Combo Pack Of 2 Men’s Casual Shoes Sneakers Fo...    ₹497
1            BRUTON    !Combo Pack Of 2 Casual Shoes! Sneakers For Men    ₹497
2              aadi  Synthetic Leather |Lightweight|Comfort|Summer|...    ₹289
3          URBANBOX  Trending Stylish Casual Outdoor Sneakers Shoes...    ₹299
4            Layasa                                   Sneakers For Men    ₹296
..              ...                                                ...     ...
95  U.S. POLO ASSN.                           CLARKIN Sneakers For Men  ₹1,709
96           BRUTON  Combo Pack Of 2 Casual Shoes Sneakers For Men ...    ₹349
97           BRUTON      Combo Pack Of 2 Casual Shoes Sneakers For Men    ₹497
98         RED TAPE                                   Sneakers For Men    ₹285
99        Deals4you                                 Sneakers For Women  ₹1,275

[100 rows x 3 columns]

Q7: Go to webpage https://www.amazon.in/ Enter “Laptop” in the search field and then click the search icon. Then
set CPU Type filter to “Intel Core i7” as shown in the below image:

After setting the filters scrape first 10 laptops data. You have to scrape 3 attributes for each laptop:
1. Title
2. Ratings
3. Price

In [328]:
driver=webdriver.Chrome()
driver.get('https://www.amazon.in/')

In [330]:
find=driver.find_element(By.CLASS_NAME,'nav-input')
find.send_keys('laptop')

search=driver.find_element(By.CLASS_NAME,'nav-search-submit')
search.click()

In [331]:
title=[]
rating=[]
price=[]

In [394]:
start=0
end=1
for items in range(start,end):
    name=driver.find_elements(By.CLASS_NAME,'a-size-medium')
    for i in name:
        title.append(i.text)
        title=title[0:10]

In [395]:
len(title)

10

In [362]:
title.clear()

In [396]:
ratings=driver.find_elements(By.CLASS_NAME,'s-underline-text')
for i in ratings:
    rating.append(i.text)
    rating=rating[0:10]

In [365]:
rating.clear()

In [397]:
rating
len(rating)

10

In [400]:
prices=driver.find_elements(By.CLASS_NAME,'a-price-whole')
for i in prices:
    price.append(i.text)
    price=price[0:10]

In [401]:
len(price)

10

In [402]:
print(len(title),len(rating),len(price))

10 10 10

In [403]:
import pandas as  pd
df=pd.DataFrame({'LAPTOP NAME':title,'RATING':rating,'PRICE':price})
df

,LAPTOP NAME,RATING,PRICE
0,"MSI Modern 14, Intel 12th Gen. i7-1255U, 36CM ...","MSI Modern 14, Intel 12th Gen. i7-1255U, 36CM ...","49,990"
1,"MSI GF63 Thin, Intel Core i7-11800H, 40CM FHD ...",22,"64,990"
2,"MSI GF63 Thin, Intel Core i7-11800H, 40CM FHD ...",22,"57,990"
3,"Dell Inspiron 5430 Laptop, Intel Core i7-1360P...",Great Indian Festival,"84,990"
4,Samsung Galaxy Book3 Core i7 13th Gen 1355U - ...,"₹49,990 M.R.P:\n₹78,990","84,390"
5,"ASUS TUF Gaming F15, 15.6""(39.62 cms) FHD 144H...","MSI GF63 Thin, Intel Core i7-11800H, 40CM FHD ...","75,990"
6,"ASUS Creator Series Vivobook 14X OLED (2023), ...",96,"79,990"
7,"ASUS Vivobook 15, Intel Core i7-12650H 12th Ge...",96,"60,990"
8,Fujitsu CH 13th Gen Intel Core i7 13.3 inch(33...,Great Indian Festival,"84,990"
9,"ASUS TUF Gaming F15 (2023) 90WHr Battery, Inte...","₹64,990 M.R.P:\n₹89,990","1,04,990"

Q8: Write a python program to scrape data for Top 1000 Quotes of All Time.
The above task will be done in following steps:
1. First get the webpagehttps://www.azquotes.com/
2. Click on TopQuotes
3. Than scrap a) Quote b) Author c) Type Of Quotes

In [406]:
driver=webdriver.Chrome()
driver.get('https://www.azquotes.com/')

In [407]:
find=driver.find_element(By.XPATH,'//*[@id="menu"]/div/div[3]/ul/li[5]/a')
find.click()

In [408]:
quote=[]
author=[]
type=[]

In [415]:
start=0
end=10
for page in range(start,end):
    q=driver.find_elements(By.CLASS_NAME,'title')
    for i in q:
        quote.append(i.text)
        quote=quote[0:1000]

In [416]:
len(quote)

1000

In [417]:
start=0
end=10
for page in range(start,end):
    a=driver.find_elements(By.CLASS_NAME,'author')
    for i in a:
        author.append(i.text)
        author=author[0:1000]

In [418]:
len(author)

1000

In [419]:
start=0
end=10
for page in range(start,end):
    t=driver.find_elements(By.CLASS_NAME,'tags')
    for i in t:
        type.append(i.text)
        type=type[0:1000]

In [420]:
len(type)

1000

In [421]:
print(len(quote),len(author),len(type))

1000 1000 1000

In [422]:
import pandas as pd
df=pd.DataFrame({'Quote':quote,'Author Name':author,'Type Of Quotes':type})
df

,Quote,Author Name,Type Of Quotes
0,Authors:,Michael Porter,"Essence, Deep Thought, Transcendentalism"
1,The essence of strategy is choosing what not t...,Golda Meir,"Inspiration, Past, Trying"
2,One cannot and must not try to erase the past ...,Theodore Roosevelt,"Country, Peace, War"
3,Patriotism means to stand by the country. It d...,Nelson Mandela,"Inspirational, Motivational, Death"
4,Death is something inevitable. When a man has ...,Erma Bombeck,"4th Of July, Food, Patriotic"
...,...,...,...
995,Never be afraid to raise your voice for honest...,Hunter S. Thompson,"Music, Sports, Hunting"
996,There are three kinds of men. The one that lea...,Corrie Ten Boom,"Trust, Encouraging, Uplifting"
997,"A strong nation, like a strong person, can aff...",Dalai Lama,"Inspirational, Funny, Change"
998,The difference between stupidity and genius is...,Mother Teresa,"Success, God, Mother"
999,We the people are the rightful masters of both...,Norman Vincent Peale,"Inspirational, Motivational, Change"

Q9: Write a python program to display list of respected former Prime Ministers of India(i.e. Name, Born-Dead,
Term of office, Remarks) from https://www.jagranjosh.com/.
This task will be done in following steps:
1. First get the webpagehttps://www.jagranjosh.com/
2. Then You have to click on the GK option
3. Then click on the List of all Prime Ministers of India
4. Then scrap the mentioned data and make theDataFrame

In [423]:
driver=webdriver.Chrome()
driver.get('https://www.jagranjosh.com/')

In [425]:
find=driver.find_element(By.XPATH,'//*[@id="__next"]/header/nav/div/div/div[3]/ul/li[6]/a')
find.click()

In [427]:
pm=driver.find_element(By.XPATH,'//*[@id="popluarGK"]/ul/li[2]/a')
pm.click()

In [428]:
name=[]
born=[]
term=[]
remark=[]

In [429]:
na=driver.find_elements(By.CLASS_NAME,'table-box')
for i in na:
    name.append(i.text)

In [430]:
name

["S.N.\nPM Name\nBorn-Dead\nTerm of office\nRemark\n1.\nJawahar Lal Nehru\n(1889–1964)\n15 August 1947 to 27 May 1964\n16 years, 286 days\nThe first prime minister of India and the longest-serving PM of India, the first to die in office.\n2.\nGulzarilal Nanda (Acting)\n(1898-1998)\n27 May 1964 to 9 June 1964,\n13 days\nFirst acting PM of India\n3.\nLal Bahadur Shastri\n(1904–1966)\n9 June 1964 to 11 January 1966\n1 year, 216 days\nHe has given the slogan of 'Jai Jawan Jai Kisan' during the Indo-Pak war of 1965\n4. \nGulzari Lal Nanda  (Acting)\n(1898-1998)\n11 January 1966 to 24 January 1966\n13 days\n-\n5.\nIndira Gandhi\n(1917–1984)\n24 January 1966 to 24 March 1977\n11 years, 59 days\nFirst female Prime Minister of India\n6.\nMorarji Desai\n(1896–1995)\n24 March 1977 to  28 July 1979 \n2 year, 126 days\nOldest to become PM (81 years old) and first to resign from office\n7.\nCharan Singh\n(1902–1987)\n28 July 1979 to 14 January 1980\n170 days\nOnly PM who did not face the Parliament\n8.\nIndira Gandhi\n(1917–1984)\n14 January 1980 to 31 October 1984\n4 years, 291 days\nThe first lady who served as PM for the second term\n9.\nRajiv Gandhi\n(1944–1991)\n31 October 1984 to 2 December 1989\n5 years, 32 days\nYoungest to become PM (40 years old)\n10.\nV. P. Singh\n(1931–2008)\n2 December 1989 to 10 November 1990\n343 days\nFirst PM to step down after a vote of no confidence\n11.\nChandra Shekhar\n(1927–2007)\n10 November 1990 to 21 June 1991\n223 days\nHe belongs to  Samajwadi Janata Party\n12.\nP. V. Narasimha Rao\n(1921–2004)\n21 June 1991 to 16 May 1996\n4 years, 330 days\nFirst PM from South India\n13.\nAtal Bihari Vajpayee\n(1924- 2018)\n16 May 1996 to 1 June 1996\n16 days\nPM for shortest tenure\n14.\nH. D. Deve Gowda\n(born 1933)\n1 June 1996 to 21 April 1997\n324 days\nHe belongs to  Janata Dal\n15.\nInder Kumar Gujral\n(1919–2012)\n21 April 1997 to 19 March 1998 \n332 days\n------\n16.\nAtal Bihari Vajpayee\n(1924-2018)\n19 March 1998 to 22 May 2004 \n6 years, 64 days\n The first non-congress PM who completed a full term as PM\n17.\nManmohan Singh\n(born 1932)\n22 May 2004 to 26 May 2014   \n10 years, 4 days\n First Sikh PM\n18.\nNarendra Modi\n(born 1950)\n26 May 2014 - 2019\n4th Prime Minister of India who served two consecutive tenures\n19.\nNarendra Modi\n(born 1950)\n30 May 2019- Incumbent\nFirst non-congress PM with two consecutive tenures",
 'List of all Presidents of India List of Nicknames of Indian Prime Ministers']

In [437]:
df=pd.DataFrame(name,columns=['NAME'])

In [438]:
df

                                                NAME
0  S.N.\nPM Name\nBorn-Dead\nTerm of office\nRema...
1  List of all Presidents of India List of Nickna...

Q10: Write a python program to display list of 50 Most expensive cars in the world (i.e.
Car name and Price) from https://www.motor1.com/

This task will be done in following steps:
1. First get the webpage https://www.motor1.com/
2. Then You have to type in the search bar ’50 most expensive cars’
3. Then click on 50 most expensive carsin the world..
4. Then scrap the mentioned data and make the dataframe.

In [444]:
driver=webdriver.Chrome()
driver.get('https://www.motor1.com/')

In [445]:
find=driver.find_element(By.CLASS_NAME,'m1-search-panel-input')
find.send_keys('Most expensive cars in the world')

In [446]:
search=driver.find_element(By.CLASS_NAME,'m1-search-panel-button')
search.click()

In [447]:
se=driver.find_element(By.CLASS_NAME,'features-search_input-submit')
se.click()

In [448]:
car=driver.find_element(By.XPATH,'//*[@id="page_index_articles_search"]/div[9]/div/div[1]/div/div/div[2]/div/div[1]/h3/a')
car.click()

In [455]:
name=[]
price=[]

In [515]:
na=driver.find_elements(By.CLASS_NAME,'subheader')
for i in na:
    name.append(i.text)
    name=name[0:20]

In [516]:
print(len(name))
print(name)

20
['Aston Martin Valour', 'McLaren Elva', 'Czinger 21C', 'Ferrari Monza', 'Gordon Murray T.33', 'Koenigsegg Gemera', 'Zenvo TSR-S', 'Hennessey Venom F5', 'Bentley Bacalar', 'Hispano Suiza Carmen Boulogne', 'Bentley Mulliner Batur', 'Deus Vayanne', 'SSC Tuatara', 'Lotus Evija', 'Aston Martin Vulcan', 'Delage D12', 'Ferrari Daytona SP3', 'McLaren Speedtail', 'Rimac Nevera', 'Pagani Utopia']

In [509]:
rs=driver.find_elements(By.XPATH,'//*[@id="article_box"]/div[1]/div[2]/div[2]/p[4]/strong')
for i in rs:
    price.append(i.text)
    price=price[0:50]
    
# IT'S NOT WORKING SIR

In [518]:
# Let's Scrape manually 
price=['Price: $1.5 Million','Price: $1.7 Million','Price: $1.7 Million','Price: $1.7 Million','Price: $1.7 Million','Price: $1.7 Million','Price: $1.7 Million','Price: $1.8 Million','Price: $1.9 Million','Price: $1.9 Million','Price: $2.0 Million','Price: $2.0 Million','Price: $2.0 Million','Price: $2.1 Million','Price: $2.3 Million','Price: $2.3 Million','Price: $2.3 Million','Price: $2.3 Million','Price: $2.4 Million','Price: $2.5 Million']
print(len(price))
print(price)

20
['Price: $1.5 Million', 'Price: $1.7 Million', 'Price: $1.7 Million', 'Price: $1.7 Million', 'Price: $1.7 Million', 'Price: $1.7 Million', 'Price: $1.7 Million', 'Price: $1.8 Million', 'Price: $1.9 Million', 'Price: $1.9 Million', 'Price: $2.0 Million', 'Price: $2.0 Million', 'Price: $2.0 Million', 'Price: $2.1 Million', 'Price: $2.3 Million', 'Price: $2.3 Million', 'Price: $2.3 Million', 'Price: $2.3 Million', 'Price: $2.4 Million', 'Price: $2.5 Million']

In [520]:
print(len(name),len(price))

20 20

In [521]:
import pandas as  pd
df=pd.DataFrame({'Car_Name':name,'Car_Price':price})
df

                         Car_Name            Car_Price
0             Aston Martin Valour  Price: $1.5 Million
1                    McLaren Elva  Price: $1.7 Million
2                     Czinger 21C  Price: $1.7 Million
3                   Ferrari Monza  Price: $1.7 Million
4              Gordon Murray T.33  Price: $1.7 Million
5               Koenigsegg Gemera  Price: $1.7 Million
6                     Zenvo TSR-S  Price: $1.7 Million
7              Hennessey Venom F5  Price: $1.8 Million
8                 Bentley Bacalar  Price: $1.9 Million
9   Hispano Suiza Carmen Boulogne  Price: $1.9 Million
10         Bentley Mulliner Batur  Price: $2.0 Million
11                   Deus Vayanne  Price: $2.0 Million
12                    SSC Tuatara  Price: $2.0 Million
13                    Lotus Evija  Price: $2.1 Million
14            Aston Martin Vulcan  Price: $2.3 Million
15                     Delage D12  Price: $2.3 Million
16            Ferrari Daytona SP3  Price: $2.3 Million
17              McLaren Speedtail  Price: $2.3 Million
18                   Rimac Nevera  Price: $2.4 Million
19                  Pagani Utopia  Price: $2.5 Million